nc: 3
backbone:
  # from  output          module       args
    - [-1, 1, Conv, [16, 3, 2]]        #  0  -> 16
    - [-1, 1, Conv, [32, 3, 2]]        #  1  -> 32
    - [-1, 1, C2f, [32, True]]         #  2  -> 32 (去掉多余的1，True代表shortcut)
    - [-1, 1, Conv, [64, 3, 2]]        #  3  -> 64
    - [-1, 2, C2f, [64, True]]         #  4  -> 64
    - [-1, 1, Conv, [128, 3, 2]]       #  5  -> 128
    - [-1, 2, C2f, [128, True]]        #  6  -> 128
    - [-1, 1, Conv, [256, 3, 2]]       #  7  -> 256
    - [-1, 1, C2f, [256, True]]        #  8  -> 256
    - [-1, 1, SPPF, [256, 5]]          #  9  -> 256
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10
  - [[-1, 6], 1, Concat, [1]]                     # 11
  - [-1, 1, C2f, [128]]                           # 12
  - [-1, 1, EMA, [128]]                           # 13
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 14
  - [[-1, 4], 1, Concat, [1]]                     # 15
  - [-1, 1, C2f, [64]]                            # 16
  - [-1, 1, EMA, [64]]                            # 17
  - [-1, 1, Conv, [64, 3, 2]]                     # 18
  - [[-1, 13], 1, Concat, [1]]                    # 19
  - [-1, 1, C2f, [128]]                           # 20
  - [-1, 1, EMA, [128]]                           # 21
  - [-1, 1, Conv, [128, 3, 2]]                    # 22
  - [[-1, 9], 1, Concat, [1]]                     # 23
  - [-1, 1, C2f, [256]]                           # 24
  - [-1, 1, EMA, [256]]                           # 25
  - [[17, 21, 25], 1, Detect, [nc]]               # 26 (严格对齐原版3头输出)