nc: 1
backbone:
  - [-1, 1, Conv, [16, 3, 2]]
  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 1, C2f, [32, True]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 2, C2f, [64, True]]
  - [-1, 1, CBAM, [64]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C2f, [128, True]]
  - [-1, 1, CBAM, [128]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, C2f, [256, True]]
  - [-1, 1, SPPF, [256, 5]]
  - [-1, 1, CBAM, [256]]
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 1, C2f, [128]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 1, C2f, [64]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 1, C2f, [128]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 1, C2f, [256]]
  - [[18, 21, 24], 1, Detect, [nc]]